# ActiveView Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstancePlacingArgs..::..ActiveView Property
FamilyInstancePlacingArgs Class See Also
---
The active view
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public View ActiveView { get; internal set; }
```

Visual Basic
---
```text
Public Property ActiveView As View
	Get
	Friend Set
```

Visual C++
---
```text
public:
property View^ ActiveView {
	View^ get ();
	internal: void set (View^ value);
}
```

# See Also
FamilyInstancePlacingArgs Class
Autodesk.Revit.UI Namespace